app/Controllers/BaseController.php

SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
AND `user`.`id_user` = 'KPD-001'
---
        elseif ($role === 'kaprodi') {

            // Ambil nppy dari tabel user berdasarkan id_user
            $u = $userModel->find($id_user);

SELECT *
FROM `dosen`
WHERE `nppy` = '150901.840531.037'
AND `jabatan_fungsional` IN ('kaprodi','Kaprodi Sistem Informasi','Kaprodi Teknik Informatika')
 LIMIT 1
---
                'Kaprodi Teknik Informatika'
            ];

            $d = $dosenModel->where('nppy', $nppy)
                            ->whereIn('jabatan_fungsional', $kaprodiRoles)
                            ->first();

SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
AND `user`.`id_user` = 'KPD-001'
SELECT *
FROM `dosen`
WHERE `nppy` = '150901.840531.037'
 LIMIT 1
---
    protected function getUserFoto()
    {
        $session = session();
        $role    = $session->get('role');
        $id_user = $session->get('id_user');

        $userModel  = new \App\Models\UserModel();
        $dosenModel = new \App\Models\DosenModel();
        $unitModel  = new \App\Models\UnitModel();

        $user = $userModel->find($id_user);

        /* === DOSEN & KAPRODI (foto dosen) === */
        if (in_array($role, ['dospem', 'kaprodi'])) {
            if (!empty($user['nppy'])) {
                $dosen = $dosenModel->where('nppy', $user['nppy'])->first();