app/Controllers/Kaprodi.php

SELECT *
FROM `user`
WHERE `nppy` = '150901.840531.037'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `dosen`
WHERE `nppy` = '150901.840531.037'
 LIMIT 1
---
    public function nilai_mahasiswa()
    {
        if (!$this->session->get('isLoggedIn') || $this->session->get('role') !== 'kaprodi') {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        // ============================================
        // 🔥 1. Ambil data kaprodi (nama + jabatan)
        // ============================================
        $nppy = $this->session->get('nppy');

        $userModel  = new \App\Models\UserModel();
        $dosenModel = new \App\Models\DosenModel();

        // Ambil user
        $user = $userModel->where('nppy', $nppy)->first();

        // Ambil dosen (nama)
        $dosen = $dosenModel->where('nppy', $nppy)->first();

SELECT `profil_magang`.`id_profil`, `mahasiswa`.`nim`, `mahasiswa`.`nama_lengkap`
FROM `profil_magang`
JOIN `mahasiswa` ON `mahasiswa`.`nim` = `profil_magang`.`nim`
WHERE `mahasiswa`.`program_studi` = 'Sistem Informasi'
AND `profil_magang`.`semester` = 'Gasal'
AND `profil_magang`.`tahun_ajaran` = '2025/2026'
AND `profil_magang`.`status` IN ('aktif','selesai')
AND `profil_magang`.`deleted_at` IS NULL
ORDER BY `mahasiswa`.`nama_lengkap` ASC
---
            : ($tahunSekarang - 1) . '/' . $tahunSekarang;

        // Ambil mahasiswa
        $mahasiswa = $this->profilMagangModel
            ->select('
                profil_magang.id_profil,
                mahasiswa.nim,
                mahasiswa.nama_lengkap
            ')
            ->join('mahasiswa', 'mahasiswa.nim = profil_magang.nim')
            ->where('mahasiswa.program_studi', $prodiFilter)
            ->where('profil_magang.semester', $semester)
            ->where('profil_magang.tahun_ajaran', $tahunAjaran)
            ->whereIn('profil_magang.status', ['aktif', 'selesai'])
            ->orderBy('mahasiswa.nama_lengkap', 'ASC')
            ->findAll();

SELECT `nilai_magang`.`id_nilai_magang`, `nilai_magang`.`role`, `nilai_magang`.`nilai`, `k`.`kode_mk`, `k`.`presentase`
FROM `nilai_magang`
JOIN `komponen_nilai` `k` ON `k`.`id_nilai` = `nilai_magang`.`id_nilai`
WHERE `nilai_magang`.`id_profil` = '22.230.0101_SN1P'
---
            $idProfil = $m['id_profil'];

            // 🔹 Ambil seluruh komponen nilai (sama seperti detail_nilai)
            $komponen = $nilaiModel
                ->select("
                    nilai_magang.id_nilai_magang,
                    nilai_magang.role,
                    nilai_magang.nilai,
                    k.kode_mk,
                    k.presentase
                ")
                ->join('komponen_nilai k', 'k.id_nilai = nilai_magang.id_nilai')
                ->where('nilai_magang.id_profil', $idProfil)
                ->findAll();