app/Controllers/KomponenNilai.php

SELECT *
FROM `program_magang`
SELECT `komponen_nilai`.*, `mata_kuliah`.`nama_mk`, `program_magang`.`nama_program`
FROM `komponen_nilai`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `komponen_nilai`.`kode_mk`
LEFT JOIN `program_magang` ON `program_magang`.`id_program` = `komponen_nilai`.`id_program`
---
    public function index()
    {
        $kodeMk = $this->request->getGet('kode_mk');
        $idProgram = $this->request->getGet('id_program');

        $data['user_name'] = $this->getUserName();
        $data['mata_kuliah'] = $this->matakuliahModel->getActive();
        $data['program_magang'] = $this->programMagangModel->findAll(); // 🔹

        // Ambil data komponen nilai
        $query = $this->komponenNilaiModel
            ->select('komponen_nilai.*, mata_kuliah.nama_mk, program_magang.nama_program')
            ->join('mata_kuliah', 'mata_kuliah.kode_mk = komponen_nilai.kode_mk')
            ->join('program_magang', 'program_magang.id_program = komponen_nilai.id_program', 'left');

        if ($kodeMk) {
            $query->where('komponen_nilai.kode_mk', $kodeMk);
        }

        if ($idProgram) {
            $query->where('komponen_nilai.id_program', $idProgram);
        }

        $data['komponen_nilai'] = $query->findAll();

INSERT INTO `komponen_nilai` (`kode_mk`, `id_program`, `komponen`, `presentase`, `role`, `created_at`, `updated_at`) VALUES ('BB010', '3', 'Latar Belakang Teori', 50, 'mitra', '2025-12-29 17:13:32', '2025-12-29 17:13:32')
---
                        'role'       => $role,
                    ];

                    $this->komponenNilaiModel->insert($data);

INSERT INTO `komponen_nilai` (`created_at`, `id_program`, `kode_mk`, `komponen`, `presentase`, `role`, `updated_at`)
VALUES ('2025-12-29 17:14:49','1','BB010','Latar Belakang Teori',30,'dospem','2025-12-29 17:14:49'), ('2025-12-29 17:14:49','1','BB010','Integritas (etika, moral dan kesungguhan)',20,'dospem','2025-12-29 17:14:49'), ('2025-12-29 17:14:49','1','BB010','Keberhasilan pencapaian Learning Objectives sesuai Leaning Plan: Pengetahuan sesuai bidang ilmu yang diperoleh di tempat kerja',20,'dospem','2025-12-29 17:14:49'), ('2025-12-29 17:14:49','1','BB010','Keaktifan',15,'dospem','2025-12-29 17:14:49'), ('2025-12-29 17:14:49','1','BB010','Kedisiplinan',15,'dospem','2025-12-29 17:14:49')
---

            // =====================
            // INSERT DATA BARU (TERMAsuk FIELD ADD)
            // =====================
            $this->komponenNilaiModel->insertBatch($dataInsert);