app/Models/MatakuliahModel.php

SELECT *
FROM `mata_kuliah`
WHERE `status` = 'aktif'
---
    public function getActive()
    {
        return $this->where('status', 'aktif')->findAll();